{"format": "graph-model", "generatedBy": "2.17.1", "convertedBy": "TensorFlow.js Converter v4.22.0", "signature": {"inputs": {"keras_tensor_1016": {"name": "keras_tensor_1016:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "256"}, {"size": "256"}, {"size": "3"}]}}}, "outputs": {"output_0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "5"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/sequential_4_1/rescaling_4_1/Cast/x", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential_4_1/rescaling_4_1/Cast_1/x", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_4_1/conv2d_20_1/convolution/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_4_1/conv2d_20_1/Reshape", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_4_1/batch_normalization_20_1/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_4_1/batch_normalization_20_1/batchnorm/sub", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_4_1/conv2d_21_1/convolution/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_4_1/conv2d_21_1/Reshape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_4_1/batch_normalization_21_1/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_4_1/batch_normalization_21_1/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_4_1/conv2d_22_1/convolution/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_4_1/conv2d_22_1/Reshape", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_4_1/batch_normalization_22_1/batchnorm/mul", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_4_1/batch_normalization_22_1/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_4_1/conv2d_23_1/convolution/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_4_1/conv2d_23_1/Reshape", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_4_1/batch_normalization_23_1/batchnorm/mul", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_4_1/batch_normalization_23_1/batchnorm/sub", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_4_1/conv2d_24_1/convolution/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "512"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_4_1/conv2d_24_1/Reshape", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "512"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_4_1/batch_normalization_24_1/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_4_1/batch_normalization_24_1/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_4_1/flatten_4_1/Reshape/shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_4_1/dense_12_1/Cast/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32768"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_4_1/dense_12_1/Add/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_4_1/dense_13_1/Cast/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_4_1/dense_13_1/Add/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_4_1/dense_14_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "5"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_4_1/dense_14_1/Add/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "5"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "keras_tensor_1016", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "256"}, {"size": "256"}, {"size": "3"}]}}}}, {"name": "StatefulPartitionedCall/sequential_4_1/rescaling_4_1/mul", "op": "Mul", "input": ["keras_tensor_1016", "StatefulPartitionedCall/sequential_4_1/rescaling_4_1/Cast/x"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_4_1/rescaling_4_1/add", "op": "AddV2", "input": ["StatefulPartitionedCall/sequential_4_1/rescaling_4_1/mul", "StatefulPartitionedCall/sequential_4_1/rescaling_4_1/Cast_1/x"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_4_1/conv2d_20_1/add", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/sequential_4_1/rescaling_4_1/add", "StatefulPartitionedCall/sequential_4_1/conv2d_20_1/convolution/ReadVariableOp", "StatefulPartitionedCall/sequential_4_1/conv2d_20_1/Reshape"], "device": "/device:CPU:0", "attr": {"use_cudnn_on_gpu": {"b": true}, "padding": {"s": "U0FNRQ=="}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "leakyrelu_alpha": {"f": 0.2}, "filter_format": {"s": "SFdJTw=="}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_host_args": {"i": "0"}, "epsilon": {"f": 0.0}}}, {"name": "StatefulPartitionedCall/sequential_4_1/max_pooling2d_20_1/MaxPool2d", "op": "MaxPool", "input": ["StatefulPartitionedCall/sequential_4_1/conv2d_20_1/add"], "attr": {"data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "padding": {"s": "VkFMSUQ="}, "T": {"type": "DT_FLOAT"}, "ksize": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "StatefulPartitionedCall/sequential_4_1/conv2d_20_1/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/sequential_4_1/max_pooling2d_20_1/MaxPool2d"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_4_1/batch_normalization_20_1/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/sequential_4_1/conv2d_20_1/Relu", "StatefulPartitionedCall/sequential_4_1/batch_normalization_20_1/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_4_1/batch_normalization_20_1/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/sequential_4_1/batch_normalization_20_1/batchnorm/mul_1", "StatefulPartitionedCall/sequential_4_1/batch_normalization_20_1/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_4_1/conv2d_21_1/add", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/sequential_4_1/batch_normalization_20_1/batchnorm/add_1", "StatefulPartitionedCall/sequential_4_1/conv2d_21_1/convolution/ReadVariableOp", "StatefulPartitionedCall/sequential_4_1/conv2d_21_1/Reshape"], "device": "/device:CPU:0", "attr": {"fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "epsilon": {"f": 0.0}, "filter_format": {"s": "SFdJTw=="}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "num_host_args": {"i": "0"}, "T": {"type": "DT_FLOAT"}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "num_args": {"i": "1"}}}, {"name": "StatefulPartitionedCall/sequential_4_1/max_pooling2d_21_1/MaxPool2d", "op": "MaxPool", "input": ["StatefulPartitionedCall/sequential_4_1/conv2d_21_1/add"], "attr": {"explicit_paddings": {"list": {}}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "T": {"type": "DT_FLOAT"}, "ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "data_format": {"s": "TkhXQw=="}, "padding": {"s": "VkFMSUQ="}}}, {"name": "StatefulPartitionedCall/sequential_4_1/conv2d_21_1/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/sequential_4_1/max_pooling2d_21_1/MaxPool2d"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_4_1/batch_normalization_21_1/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/sequential_4_1/conv2d_21_1/Relu", "StatefulPartitionedCall/sequential_4_1/batch_normalization_21_1/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_4_1/batch_normalization_21_1/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/sequential_4_1/batch_normalization_21_1/batchnorm/mul_1", "StatefulPartitionedCall/sequential_4_1/batch_normalization_21_1/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_4_1/conv2d_22_1/add", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/sequential_4_1/batch_normalization_21_1/batchnorm/add_1", "StatefulPartitionedCall/sequential_4_1/conv2d_22_1/convolution/ReadVariableOp", "StatefulPartitionedCall/sequential_4_1/conv2d_22_1/Reshape"], "device": "/device:CPU:0", "attr": {"num_args": {"i": "1"}, "T": {"type": "DT_FLOAT"}, "leakyrelu_alpha": {"f": 0.2}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "num_host_args": {"i": "0"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "filter_format": {"s": "SFdJTw=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "epsilon": {"f": 0.0}}}, {"name": "StatefulPartitionedCall/sequential_4_1/max_pooling2d_22_1/MaxPool2d", "op": "MaxPool", "input": ["StatefulPartitionedCall/sequential_4_1/conv2d_22_1/add"], "attr": {"T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "padding": {"s": "VkFMSUQ="}, "ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}}}, {"name": "StatefulPartitionedCall/sequential_4_1/conv2d_22_1/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/sequential_4_1/max_pooling2d_22_1/MaxPool2d"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_4_1/batch_normalization_22_1/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/sequential_4_1/conv2d_22_1/Relu", "StatefulPartitionedCall/sequential_4_1/batch_normalization_22_1/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_4_1/batch_normalization_22_1/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/sequential_4_1/batch_normalization_22_1/batchnorm/mul_1", "StatefulPartitionedCall/sequential_4_1/batch_normalization_22_1/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_4_1/conv2d_23_1/add", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/sequential_4_1/batch_normalization_22_1/batchnorm/add_1", "StatefulPartitionedCall/sequential_4_1/conv2d_23_1/convolution/ReadVariableOp", "StatefulPartitionedCall/sequential_4_1/conv2d_23_1/Reshape"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "filter_format": {"s": "SFdJTw=="}, "leakyrelu_alpha": {"f": 0.2}, "num_args": {"i": "1"}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "StatefulPartitionedCall/sequential_4_1/max_pooling2d_23_1/MaxPool2d", "op": "MaxPool", "input": ["StatefulPartitionedCall/sequential_4_1/conv2d_23_1/add"], "attr": {"explicit_paddings": {"list": {}}, "T": {"type": "DT_FLOAT"}, "ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "padding": {"s": "VkFMSUQ="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "data_format": {"s": "TkhXQw=="}}}, {"name": "StatefulPartitionedCall/sequential_4_1/conv2d_23_1/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/sequential_4_1/max_pooling2d_23_1/MaxPool2d"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_4_1/batch_normalization_23_1/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/sequential_4_1/conv2d_23_1/Relu", "StatefulPartitionedCall/sequential_4_1/batch_normalization_23_1/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_4_1/batch_normalization_23_1/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/sequential_4_1/batch_normalization_23_1/batchnorm/mul_1", "StatefulPartitionedCall/sequential_4_1/batch_normalization_23_1/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_4_1/conv2d_24_1/add", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/sequential_4_1/batch_normalization_23_1/batchnorm/add_1", "StatefulPartitionedCall/sequential_4_1/conv2d_24_1/convolution/ReadVariableOp", "StatefulPartitionedCall/sequential_4_1/conv2d_24_1/Reshape"], "device": "/device:CPU:0", "attr": {"data_format": {"s": "TkhXQw=="}, "leakyrelu_alpha": {"f": 0.2}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_host_args": {"i": "0"}, "filter_format": {"s": "SFdJTw=="}, "epsilon": {"f": 0.0}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "padding": {"s": "U0FNRQ=="}}}, {"name": "StatefulPartitionedCall/sequential_4_1/max_pooling2d_24_1/MaxPool2d", "op": "MaxPool", "input": ["StatefulPartitionedCall/sequential_4_1/conv2d_24_1/add"], "attr": {"data_format": {"s": "TkhXQw=="}, "ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "padding": {"s": "VkFMSUQ="}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "StatefulPartitionedCall/sequential_4_1/conv2d_24_1/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/sequential_4_1/max_pooling2d_24_1/MaxPool2d"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_4_1/batch_normalization_24_1/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/sequential_4_1/conv2d_24_1/Relu", "StatefulPartitionedCall/sequential_4_1/batch_normalization_24_1/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_4_1/batch_normalization_24_1/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/sequential_4_1/batch_normalization_24_1/batchnorm/mul_1", "StatefulPartitionedCall/sequential_4_1/batch_normalization_24_1/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_4_1/flatten_4_1/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/sequential_4_1/batch_normalization_24_1/batchnorm/add_1", "StatefulPartitionedCall/sequential_4_1/flatten_4_1/Reshape/shape"], "attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_4_1/dense_12_1/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_4_1/flatten_4_1/Reshape", "StatefulPartitionedCall/sequential_4_1/dense_12_1/Cast/ReadVariableOp", "StatefulPartitionedCall/sequential_4_1/dense_12_1/Add/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"num_args": {"i": "1"}, "T": {"type": "DT_FLOAT"}, "leakyrelu_alpha": {"f": 0.2}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "epsilon": {"f": 0.0}, "transpose_a": {"b": false}, "transpose_b": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_4_1/dense_13_1/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_4_1/dense_12_1/Relu", "StatefulPartitionedCall/sequential_4_1/dense_13_1/Cast/ReadVariableOp", "StatefulPartitionedCall/sequential_4_1/dense_13_1/Add/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"leakyrelu_alpha": {"f": 0.2}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "transpose_b": {"b": false}, "transpose_a": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_4_1/dense_14_1/Add", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_4_1/dense_13_1/Relu", "StatefulPartitionedCall/sequential_4_1/dense_14_1/Cast/ReadVariableOp", "StatefulPartitionedCall/sequential_4_1/dense_14_1/Add/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"num_args": {"i": "1"}, "transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "T": {"type": "DT_FLOAT"}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}}}, {"name": "StatefulPartitionedCall/sequential_4_1/dense_14_1/Softmax", "op": "Softmax", "input": ["StatefulPartitionedCall/sequential_4_1/dense_14_1/Add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/sequential_4_1/dense_14_1/Softmax"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 1882}}, "weightsManifest": [{"paths": ["group1-shard1of5.bin", "group1-shard2of5.bin", "group1-shard3of5.bin", "group1-shard4of5.bin", "group1-shard5of5.bin"], "weights": [{"name": "StatefulPartitionedCall/sequential_4_1/rescaling_4_1/Cast/x", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_4_1/rescaling_4_1/Cast_1/x", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_4_1/conv2d_20_1/convolution/ReadVariableOp", "shape": [3, 3, 3, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_4_1/conv2d_20_1/Reshape", "shape": [1, 1, 1, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_4_1/batch_normalization_20_1/batchnorm/mul", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_4_1/batch_normalization_20_1/batchnorm/sub", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_4_1/conv2d_21_1/convolution/ReadVariableOp", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_4_1/conv2d_21_1/Reshape", "shape": [1, 1, 1, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_4_1/batch_normalization_21_1/batchnorm/mul", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_4_1/batch_normalization_21_1/batchnorm/sub", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_4_1/conv2d_22_1/convolution/ReadVariableOp", "shape": [3, 3, 64, 128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_4_1/conv2d_22_1/Reshape", "shape": [1, 1, 1, 128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_4_1/batch_normalization_22_1/batchnorm/mul", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_4_1/batch_normalization_22_1/batchnorm/sub", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_4_1/conv2d_23_1/convolution/ReadVariableOp", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_4_1/conv2d_23_1/Reshape", "shape": [1, 1, 1, 128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_4_1/batch_normalization_23_1/batchnorm/mul", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_4_1/batch_normalization_23_1/batchnorm/sub", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_4_1/conv2d_24_1/convolution/ReadVariableOp", "shape": [3, 3, 128, 512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_4_1/conv2d_24_1/Reshape", "shape": [1, 1, 1, 512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_4_1/batch_normalization_24_1/batchnorm/mul", "shape": [512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_4_1/batch_normalization_24_1/batchnorm/sub", "shape": [512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_4_1/flatten_4_1/Reshape/shape", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_4_1/dense_12_1/Cast/ReadVariableOp", "shape": [32768, 128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_4_1/dense_12_1/Add/ReadVariableOp", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_4_1/dense_13_1/Cast/ReadVariableOp", "shape": [128, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_4_1/dense_13_1/Add/ReadVariableOp", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_4_1/dense_14_1/Cast/ReadVariableOp", "shape": [64, 5], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_4_1/dense_14_1/Add/ReadVariableOp", "shape": [5], "dtype": "float32"}]}]}